# Thisaru's Dotfiles Brewfile
# Generated automatically from packages.json
# Configuration version: 1.0.0
# Generated on: 2025-10-08 17:59:34
# Install with: brew bundle

# Homebrew taps
tap "jesseduffield/lazygit"    # Official lazygit tap for frequent updates
tap "jesseduffield/lazydocker" # Official lazydocker tap

# Essential tools required for dotfiles functionality
brew "stow"                         # Symlink farm manager (use --no-folding for reliable symlinks)
brew "starship"                     # Fast, modern shell prompt written in Rust
brew "fzf"                          # Fuzzy finder
brew "zoxide"                       # Smart cd command
brew "tree"                         # Directory tree viewer
brew "bat"                          # Cat clone with syntax highlighting
brew "eza"                          # Modern ls replacement
brew "ripgrep"                      # Fast text search
brew "fd"                           # Find replacement
brew "git-delta"                    # Git diff viewer
brew "lazygit"                      # Terminal UI for git (official tap for frequent updates)
brew "lazydocker"                   # Terminal UI for Docker
brew "tmux"                         # Terminal multiplexer
brew "htop"                         # System monitor
brew "direnv"                       # Directory-specific environments
brew "atuin"                        # Shell history with sync
brew "gh"                           # GitHub CLI
brew "git-flow-avh"                 # Git branching model extension

# Tools for managing secrets and encryption
brew "sops"                         # Secrets OPerationS
brew "age"                          # Simple file encryption

# JSON/YAML processing and viewing
brew "jq"                           # JSON processor for scripts
brew "jless"                        # Interactive JSON/YAML viewer

# AI/Development Tools
cask "antigravity"                  # AI Agent

# Language version managers and development tools
brew "ballerina"                    # Cloud-native programming language

# Nerd fonts with icons for terminal display
cask "font-fira-code-nerd-font"     # Nerd font with icons

