# Thisaru's Dotfiles Brewfile
# Generated automatically from packages.json
# Configuration version: 1.0.0
# Generated on: 2025-10-08 17:59:34
# Install with: brew bundle

# Homebrew taps
tap "homebrew/bundle"  # Homebrew bundle support
tap "homebrew/cask-fonts"  # Font packages
tap "jesseduffield/lazygit"  # Official lazygit tap for frequent updates

# Essential tools required for dotfiles functionality
brew "stow"                         # Symlink farm manager
brew "starship"                     # Fast, modern shell prompt written in Rust
brew "fzf"                          # Fuzzy finder
brew "zoxide"                       # Smart cd command
brew "tree"                         # Directory tree viewer
brew "bat"                          # Cat clone with syntax highlighting
brew "eza"                          # Modern ls replacement
brew "ripgrep"                      # Fast text search
brew "fd"                           # Find replacement
brew "git-delta"                    # Git diff viewer
brew "lazygit"                      # Terminal UI for git (official tap for frequent updates)
brew "tmux"                         # Terminal multiplexer
brew "htop"                         # System monitor
brew "direnv"                       # Directory-specific environments
brew "atuin"                        # Shell history with sync
brew "gh"                           # GitHub CLI
brew "git-flow-avh"                 # Git branching model extension

# Tools for managing secrets and encryption
brew "sops"                         # Secrets OPerationS
brew "age"                          # Simple file encryption

# JSON processing (Required for some scripts)
brew "jq"

# Antigravity (AI Agent)
brew "antigravity"

# Language version managers and development tools
brew "ballerina"                    # Cloud-native programming language

# Nerd fonts with icons for terminal display
cask "font-fira-code-nerd-font"     # Nerd font with icons

