# Thisaru's Dotfiles Brewfile
# Generated automatically from packages.json
# Configuration version: 1.0.0
# Generated on: 2025-09-25 14:22:38
# Install with: brew bundle

# Homebrew taps
tap "homebrew/bundle"  # Homebrew bundle support
tap "homebrew/cask-fonts"  # Font packages
tap "jesseduffield/lazygit"  # Official lazygit tap for frequent updates

# Essential tools required for dotfiles functionality
brew "stow"                             # Symlink farm manager
brew "oh-my-posh"                       # Modern shell prompt
brew "fzf"                              # Fuzzy finder
brew "zoxide"                           # Smart cd command
brew "tree"                             # Directory tree viewer
brew "bat"                              # Cat clone with syntax highlighting
brew "eza"                              # Modern ls replacement
brew "ripgrep"                          # Fast text search
brew "fd"                               # Find replacement
brew "git-delta"                        # Git diff viewer
brew "jesseduffield/lazygit/lazygit"    # Terminal UI for git
brew "tmux"                             # Terminal multiplexer
brew "htop"                             # System monitor
brew "direnv"                           # Directory-specific environments
brew "atuin"                            # Shell history with sync
brew "gh"                               # GitHub CLI

# Tools for managing secrets and encryption
brew "sops"                             # Secrets OPerationS
brew "age"                              # Simple file encryption

# Nerd fonts with icons for terminal display
cask "font-fira-code-nerd-font"         # Nerd font with icons

# Optional packages (uncomment to install)
# ==================================================

# Language version managers and development tools (optional - uncomment as needed)
brew "pyenv"                            # Python version manager
# brew "rbenv"                          # Ruby version manager
brew "nvm"                              # Node.js version manager

# Database servers and tools (optional - uncomment as needed)
# brew "postgresql@16"                  # PostgreSQL database
# brew "redis"                          # In-memory data store

# AWS development tools (optional - uncomment as needed)
# brew "aws-vault"                      # AWS credentials manager

# Code editors and IDEs (optional - uncomment as needed)
# cask "cursor"                         # AI-powered code editor
cask "visual-studio-code"               # Microsoft's code editor

# Modern terminal applications (optional - uncomment as needed)
cask "warp"                             # Modern terminal with AI features
# cask "iterm2"                         # Feature-rich terminal

# Container management tools (optional - uncomment as needed)
cask "rancher-desktop"                  # Container management (Docker alternative)
# cask "docker"                         # Docker Desktop

# Productivity and utility applications (optional - uncomment as needed)
cask "postman"                          # API testing tool
# cask "tableplus"                      # Database management
# cask "raycast"                        # Spotlight replacement
# cask "rectangle"                      # Window management
# cask "alfred"                         # Productivity launcher

